

sequence = {"iter": 4,
			"start": "F++F-F++F",
			"variables": "FX+-[]",
			"rule": {
				"F": "FF+[-FF-F+F+F]F-",
				}
			}

#Переместить - 0 Параметры: длина отрезка
#Рисовать - 1 Параметры: длина отрезка
#Повороот - 2 Параметры: 1,2 - поворот в лево в право, поворот в градусах
#Повороот рандом - 3 Параметры: 1,2 - поворот в лево в право, поворот в градусах, мин, макс
#Сохранить - 4
#Востановить - 5
functions = {"F": "1.3",
			"X": "1.4",
			"+": "2.30",
			"-": "2.-30",
			"[": "4",
			"]": "5",}

